# 1. Напишіть функцію, що приймає один аргумент будь-якого типу та повертає цей аргумент, перетворений на float.
# Якщо перетворити не вдається функція має повернути 0.
#
# 2. Напишіть функцію, що приймає два аргументи. Функція повинна
# якщо аргументи відносяться до числових типів (int, float) - повернути перемножене значення цих аргументів,
# якщо обидва аргументи це строки (str) - обʼєднати в одну строку та повернути
# у будь-якому іншому випадку повернути кортеж з цих аргументів
#
# 3. Перепишіть за допомогою функцій вашу программу "Касир в кінотеатрі", яка буде виконувати наступне:
# Попросіть користувача ввести свсвій вік.
# - якщо користувачу менше 7 - вивести "Тобі ж <> <>! Де твої батьки?"
# - якщо користувачу менше 16 - вивести "Тобі лише <> <>, а це е фільм для дорослих!"
# - якщо користувачу більше 65 - вивести "Вам <> <>? Покажіть пенсійне посвідчення!"
# - якщо вік користувача містить 7 - вивести "Вам <> <>, вам пощастить"
# - у будь-якому іншому випадку - вивести "Незважаючи на те, що вам <> <>, білетів всеодно нема!"
#
# Замість <> <> в кожну відповідь підставте значення віку (цифру) та правильну форму слова рік. Для будь-якої відповіді
# форма слова "рік" має відповідати значенню віку користувача (1 - рік, 22 - роки, 35 - років і тд...).


# Task1
def to_float(arg):
    try:
        return float(arg)
    except:
        return 0


# Task2
def some_func(arg1, arg2):
    if (type(arg1) in (int, float)) and (type(arg2) in (int, float)):
        return arg1 * arg2
    elif type(arg1) == type(arg2) == str:
        return arg1 + arg2
    else:
        return arg1, arg2


# Task3

# Функція вводу
def age_input():
    age = input("Введіть, будь ласка, свій вік (цифрами від 1 до 125): ")
    return age


# Функція для валідації вводу
def age_validation():
    while True:
        age = age_input()
        if not age.isnumeric():
            print('Можна використовувати тільки цілі цифри!\n')
        else:
            age_int = int(age)
            # перевірка на адекватність
            if age_int < 1 or age_int > 125 or len(age) > 3:
                print('Неадекватні дані\n')
            else:
                return age


# Функція для визначення форми слова "рік"
def age_form_check(age):
    if 10 < int(age[-2:]) < 20:
        return "років"
    elif int(age[-1]) == 1:
        return 'рік'
    elif 1 < int(age[-1]) < 5:
        return 'роки'
    else:
        return 'років'


# Функція, яка виводить фінальне повідомлення
def print_message():
    # Рік користувача
    age = age_validation()
    # В функції ця змінна знадобиться як в int, так і в str-форматах
    age_int = int(age)
    # Змінна, в якій форма слова "рік"
    age_form = age_form_check(age)
    if '7' in age:
        print(f"Вам {age} {age_form}, вам пощастить\n")
    elif age_int < 7:
        print(f"Тобі ж {age} {age_form}! Де твої батьки?\n")
    elif age_int < 16:
        print(f"Тобі лише {age} {age_form}, а це фільм для дорослих!\n")
    elif age_int > 65:
        print(f"Вам {age} {age_form}? Покажіть пенсійне посвідчення!\n")
    else:
        print(f"Незважаючи на те, що вам {age} {age_form}, білетів всеодно нема!\n")


# Для зручності перевірки третьої вправи додаю безкінечний цикл
while True:
    print_message()
